
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьСпецификации)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьСпецификации(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать("Спецификация судна");
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьСпецификации(ТабДок, ПараметрКоманды)
	Документы.Договоры.ПечатьСпецификации(ТабДок, ПараметрКоманды);
КонецПроцедуры
