
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьДоговора)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьДоговора(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать("Основной договор");
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьДоговора(ТабДок, ПараметрКоманды)
	Документы.Договоры.ПечатьДоговора(ТабДок, ПараметрКоманды);
КонецПроцедуры
