
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЦеныНоменклатуры
	Движения.ЦеныНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаПереченьПродукции Из ПереченьПродукции Цикл
		Движение = Движения.ЦеныНоменклатуры.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаПереченьПродукции.Продукция;
		Движение.ЦенаСНДС = ТекСтрокаПереченьПродукции.ЦенаСНДС;
	КонецЦикла;

	// регистр ЦеныНоменклатуры
	Движения.ЦеныНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаПереченьАксессуаров Из ПереченьАксессуаров Цикл
		Движение = Движения.ЦеныНоменклатуры.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаПереченьАксессуаров.Аксессуар;
		Движение.ЦенаСНДС = ТекСтрокаПереченьАксессуаров.ЦенаСНДС;
	КонецЦикла;

	// регистр ЦеныНоменклатуры
	Движения.ЦеныНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаПереченьЦветов Из ПереченьЦветов Цикл
		Движение = Движения.ЦеныНоменклатуры.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаПереченьЦветов.Цвет;
		Движение.ЦенаСНДС = ТекСтрокаПереченьЦветов.ЦенаСНДС;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
