
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьСчета)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьСчета(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать("Счет на оплату");
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьСчета(ТабДок, ПараметрКоманды)
	Документы.Договоры.ПечатьСчета(ТабДок, ПараметрКоманды);
КонецПроцедуры
