
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьГрафикаПлатежей)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьГрафикаПлатежей(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать("График платежей");
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьГрафикаПлатежей(ТабДок, ПараметрКоманды)
	Документы.Договоры.ПечатьГрафикаПлатежей(ТабДок, ПараметрКоманды);
КонецПроцедуры
