
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьДополнительногоОборудования)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьДополнительногоОборудования(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать("Дополнительное оборудование и порядок работ");
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьДополнительногоОборудования(ТабДок, ПараметрКоманды)
	Документы.Договоры.ПечатьДополнительногоОборудования(ТабДок, ПараметрКоманды);
КонецПроцедуры
