&НаСервере
Функция ПолучитьНалогПродукции (Продукция)
	Возврат Продукция.Налог;	
КонецФункции 

&НаСервере
Функция ПолучитьНалогАксессуаров (Аксессуары)
	Возврат Аксессуары.Налог;	
КонецФункции

&НаСервере
Функция ПолучитьНалогЦветов (Цвета)
	Возврат Цвета.Налог;	
КонецФункции


&НаКлиенте
Процедура ПереченьПродукцииПродукцияПриИзменении(Элемент)
	Стр = Элементы.ПереченьПродукции.ТекущиеДанные;
	Стр.Налог = ПолучитьНалогПродукции (Стр.Продукция);
	Стр.ЦенаСНДС = Окр((1 + Стр.Налог / 100) * Стр.ЦенаБезНДС, 2);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереченьПродукцииЦенаБезНДСПриИзменении(Элемент)
	Стр = Элементы.ПереченьПродукции.ТекущиеДанные;
	Стр.ЦенаСНДС = Окр((1 + Стр.Налог / 100) * Стр.ЦенаБезНДС, 2);
КонецПроцедуры

&НаКлиенте
Процедура ПереченьАксессуаровАксессуарПриИзменении(Элемент)
	Стр = Элементы.ПереченьАксессуаров.ТекущиеДанные;
	Стр.Налог = ПолучитьНалогАксессуаров(Стр.Аксессуар);
	Стр.ЦенаСНДС = Окр((1 + Стр.Налог / 100) * Стр.ЦенаБезНДС, 2);
КонецПроцедуры

&НаКлиенте
Процедура ПереченьАксессуаровЦенаБезНДСПриИзменении(Элемент)
	 Стр = Элементы.ПереченьАксессуаров.ТекущиеДанные;
	 Стр.ЦенаСНДС = Окр((1 + Стр.Налог / 100) * Стр.ЦенаБезНДС, 2);
 КонецПроцедуры

&НаКлиенте
 Процедура ПереченьЦветовЦветПриИзменении(Элемент)
	 Стр = Элементы.ПереченьЦветов.ТекущиеДанные;
	 Стр.Налог = ПолучитьНалогЦветов (Стр.Цвет);
	 Стр.ЦенаСНДС = Окр((1 + Стр.Налог / 100) * Стр.ЦенаБезНДС, 2);
 КонецПроцедуры

&НаКлиенте
 Процедура ПереченьЦветовЦенаБезНДСПриИзменении(Элемент)
	 Стр = Элементы.ПереченьЦветов.ТекущиеДанные;
	 Стр.ЦенаСНДС = Окр((1 + Стр.Налог / 100) * Стр.ЦенаБезНДС, 2);
 КонецПроцедуры
 
 
 
 
