
Процедура ПечатьДоговора(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьДоговора)
	Макет = Документы.Договоры.ПолучитьМакет("ПечатьДоговора");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Договоры.Дата,
	|	Договоры.Доставка,
	|	Договоры.Заказ,
	|	Договоры.Контрагент,
	|	Договоры.МодельЯхты,
	|	Договоры.НаименованиеСудна,
	|	Договоры.Номер,
	|	Договоры.Покраска,
	|	Договоры.ПроцентПредоплаты,
	|	Договоры.Сотрудник,
	|	Договоры.СуммаЗаказа,
	|	Договоры.СуммаПредоплаты,
	|	Договоры.ЦенаСудна,
	|	Договоры.СписокАксессуаров.(
	|		НомерСтроки,
	|		Аксессуар,
	|		ЦенаСНДС,
	|		Количество,
	|		СуммаСНДС
	|	),
	|	Договоры.ДополнительныеРаботы.(
	|		НомерСтроки,
	|		ДополнительныйЦвет,
	|		ЦенаСНДС
	|	),
	|	Договоры.ДанныеДоставки.(
	|		НомерСтроки,
	|		Получатель,
	|		АдресДоставки,
	|		КонтактыПолучателя,
	|		ДатаДоставки,
	|		ВремяДоставки
	|	)
	|ИЗ
	|	Документ.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокАксессуаровШапка = Макет.ПолучитьОбласть("СписокАксессуаровШапка");
	ОбластьСписокАксессуаров = Макет.ПолучитьОбласть("СписокАксессуаров");
	ОбластьДополнительныеРаботыШапка = Макет.ПолучитьОбласть("ДополнительныеРаботыШапка");
	ОбластьДополнительныеРаботы = Макет.ПолучитьОбласть("ДополнительныеРаботы");
	ОбластьДанныеДоставкиШапка = Макет.ПолучитьОбласть("ДанныеДоставкиШапка");
	ОбластьДанныеДоставки = Макет.ПолучитьОбласть("ДанныеДоставки");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		//Из выборки подтянуть значения по совпадающим реквизитам
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		//Из макета ТабДока взять Дату старого формата и переделать на новый вид представления
		ОбластьЗаголовок.Параметры.Дата = Формат(ОбластьЗаголовок.Параметры.Дата,"ДЛФ=DD");
		//Добавить макет в Табличный документ

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСписокАксессуаровШапка);
		ВыборкаСписокАксессуаров = Выборка.СписокАксессуаров.Выбрать();
		Пока ВыборкаСписокАксессуаров.Следующий() Цикл
			ОбластьСписокАксессуаров.Параметры.Заполнить(ВыборкаСписокАксессуаров);
			ТабДок.Вывести(ОбластьСписокАксессуаров, ВыборкаСписокАксессуаров.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьДополнительныеРаботыШапка);
		ВыборкаДополнительныеРаботы = Выборка.ДополнительныеРаботы.Выбрать();
		Пока ВыборкаДополнительныеРаботы.Следующий() Цикл
			ОбластьДополнительныеРаботы.Параметры.Заполнить(ВыборкаДополнительныеРаботы);
			ТабДок.Вывести(ОбластьДополнительныеРаботы, ВыборкаДополнительныеРаботы.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьДанныеДоставкиШапка);
		ВыборкаДанныеДоставки = Выборка.ДанныеДоставки.Выбрать();
		Пока ВыборкаДанныеДоставки.Следующий() Цикл
			ОбластьДанныеДоставки.Параметры.Заполнить(ВыборкаДанныеДоставки);
			ТабДок.Вывести(ОбластьДанныеДоставки, ВыборкаДанныеДоставки.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

Процедура ПечатьСчета(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьСчета)
	Макет = Документы.Договоры.ПолучитьМакет("ПечатьСчета");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Договоры.Дата,
	|	Договоры.Заказ,
	|	Договоры.Контрагент,
	|	Договоры.НаименованиеСудна,
	|	Договоры.Номер,
	|	Договоры.ПроцентПредоплаты,
	|	Договоры.Сотрудник,
	|	Договоры.СуммаЗаказа,
	|	Договоры.СуммаПредоплаты,
	|	Договоры.ЦенаСудна,
	|	Договоры.СписокАксессуаров.(
	|		НомерСтроки,
	|		Аксессуар,
	|		СуммаСНДС
	|	),
	|	Договоры.ДополнительныеРаботы.(
	|		НомерСтроки,
	|		ДополнительныйЦвет,
	|		ЦенаСНДС
	|	)
	|ИЗ
	|	Документ.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокАксессуаровШапка = Макет.ПолучитьОбласть("СписокАксессуаровШапка");
	ОбластьСписокАксессуаров = Макет.ПолучитьОбласть("СписокАксессуаров");
	ОбластьДополнительныеРаботыШапка = Макет.ПолучитьОбласть("ДополнительныеРаботыШапка");
	ОбластьДополнительныеРаботы = Макет.ПолучитьОбласть("ДополнительныеРаботы");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		//Из выборки подтянуть значения по совпадающим реквизитам
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		//Из макета ТабДока взять Дату старого формата и переделать на новый вид представления
		ОбластьЗаголовок.Параметры.Дата = Формат(ОбластьЗаголовок.Параметры.Дата,"ДЛФ=DD");
		//Добавить макет в Табличный документ

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСписокАксессуаровШапка);
		ВыборкаСписокАксессуаров = Выборка.СписокАксессуаров.Выбрать();
		Пока ВыборкаСписокАксессуаров.Следующий() Цикл
			ОбластьСписокАксессуаров.Параметры.Заполнить(ВыборкаСписокАксессуаров);
			ТабДок.Вывести(ОбластьСписокАксессуаров, ВыборкаСписокАксессуаров.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьДополнительныеРаботыШапка);
		ВыборкаДополнительныеРаботы = Выборка.ДополнительныеРаботы.Выбрать();
		Пока ВыборкаДополнительныеРаботы.Следующий() Цикл
			ОбластьДополнительныеРаботы.Параметры.Заполнить(ВыборкаДополнительныеРаботы);
			ТабДок.Вывести(ОбластьДополнительныеРаботы, ВыборкаДополнительныеРаботы.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

Процедура ПечатьГрафикаПлатежей(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьГрафикаПлатежей)
	Макет = Документы.Договоры.ПолучитьМакет("ПечатьГрафикаПлатежей");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Договоры.Дата,
	|	Договоры.ДатаПервогоПлатежа,
	|	Договоры.Заказ,
	|	Договоры.КоличествоПлатежей,
	|	Договоры.Контрагент,
	|	Договоры.НаименованиеСудна,
	|	Договоры.Номер,
	|	Договоры.Сотрудник,
	|	Договоры.СуммаЗаказа,
	|	Договоры.СуммаПредоплаты,
	|	Договоры.ГрафикПлатежей.(
	|		НомерСтроки,
	|		ДатаПлатежа,
	|		СуммаПлатежа,
	|		ОстатокЗадолженности
	|	)
	|ИЗ
	|	Документ.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьГрафикПлатежейШапка = Макет.ПолучитьОбласть("ГрафикПлатежейШапка");
	ОбластьГрафикПлатежей = Макет.ПолучитьОбласть("ГрафикПлатежей");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		//Из выборки подтянуть значения по совпадающим реквизитам
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		//Из макета ТабДока взять Дату старого формата и переделать на новый вид представления
		ОбластьЗаголовок.Параметры.Дата = Формат(ОбластьЗаголовок.Параметры.Дата,"ДЛФ=DD");
		//Добавить макет в Табличный документ

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьГрафикПлатежейШапка);
		ВыборкаГрафикПлатежей = Выборка.ГрафикПлатежей.Выбрать();
		Пока ВыборкаГрафикПлатежей.Следующий() Цикл
			ОбластьГрафикПлатежей.Параметры.Заполнить(ВыборкаГрафикПлатежей);
			ТабДок.Вывести(ОбластьГрафикПлатежей, ВыборкаГрафикПлатежей.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

Процедура ПечатьСпецификации(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьСпецификации)
	Макет = Документы.Договоры.ПолучитьМакет("ПечатьСпецификации");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Договоры.Дата,
	|	Договоры.Заказ,
	|	Договоры.Контрагент,
	|	Договоры.МодельЯхты,
	|	Договоры.НаименованиеСудна,
	|	Договоры.Номер,
	|	Договоры.Сотрудник,
	|	Договоры.СпецификацияСудна.(
	|		НомерСтроки,
	|		ТипЯхты,
	|		Материал,
	|		СтандартныйЦвет,
	|		НаличиеМачты,
	|		КоличествоМест
	|	),
	|	Договоры.СписокАксессуаров.(
	|		НомерСтроки,
	|		Аксессуар,
	|		Количество
	|	),
	|	Договоры.ДополнительныеРаботы.(
	|		НомерСтроки,
	|		ДополнительныйЦвет
	|	)
	|ИЗ
	|	Документ.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСпецификацияСуднаШапка = Макет.ПолучитьОбласть("СпецификацияСуднаШапка");
	ОбластьСпецификацияСудна = Макет.ПолучитьОбласть("СпецификацияСудна");
	ОбластьСписокАксессуаровШапка = Макет.ПолучитьОбласть("СписокАксессуаровШапка");
	ОбластьСписокАксессуаров = Макет.ПолучитьОбласть("СписокАксессуаров");
	ОбластьДополнительныеРаботыШапка = Макет.ПолучитьОбласть("ДополнительныеРаботыШапка");
	ОбластьДополнительныеРаботы = Макет.ПолучитьОбласть("ДополнительныеРаботы");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		//Из выборки подтянуть значения по совпадающим реквизитам
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		//Из макета ТабДока взять Дату старого формата и переделать на новый вид представления
		ОбластьЗаголовок.Параметры.Дата = Формат(ОбластьЗаголовок.Параметры.Дата,"ДЛФ=DD");
		//Добавить макет в Табличный документ

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСпецификацияСуднаШапка);
		ВыборкаСпецификацияСудна = Выборка.СпецификацияСудна.Выбрать();
		Пока ВыборкаСпецификацияСудна.Следующий() Цикл
			ОбластьСпецификацияСудна.Параметры.Заполнить(ВыборкаСпецификацияСудна);
			ТабДок.Вывести(ОбластьСпецификацияСудна, ВыборкаСпецификацияСудна.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьСписокАксессуаровШапка);
		ВыборкаСписокАксессуаров = Выборка.СписокАксессуаров.Выбрать();
		Пока ВыборкаСписокАксессуаров.Следующий() Цикл
			ОбластьСписокАксессуаров.Параметры.Заполнить(ВыборкаСписокАксессуаров);
			ТабДок.Вывести(ОбластьСписокАксессуаров, ВыборкаСписокАксессуаров.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьДополнительныеРаботыШапка);
		ВыборкаДополнительныеРаботы = Выборка.ДополнительныеРаботы.Выбрать();
		Пока ВыборкаДополнительныеРаботы.Следующий() Цикл
			ОбластьДополнительныеРаботы.Параметры.Заполнить(ВыборкаДополнительныеРаботы);
			ТабДок.Вывести(ОбластьДополнительныеРаботы, ВыборкаДополнительныеРаботы.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

Процедура ПечатьДополнительногоОборудования(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьДополнительногоОборудования)
	Макет = Документы.Договоры.ПолучитьМакет("ПечатьДополнительногоОборудования");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Договоры.Дата,
	|	Договоры.ДатаЗапускаВПроизводство,
	|	Договоры.Заказ,
	|	Договоры.Контрагент,
	|	Договоры.НаименованиеСудна,
	|	Договоры.Номер,
	|	Договоры.Сотрудник,
	|	Договоры.СписокАксессуаров.(
	|		НомерСтроки,
	|		Аксессуар,
	|		ЦенаСНДС,
	|		Количество,
	|		СуммаСНДС
	|	),
	|	Договоры.ПорядокРабот.(
	|		НомерСтроки,
	|		ВидРаботы,
	|		КоличествоДней,
	|		ДатаНачалаРаботы,
	|		ДатаОкончанияРаботы
	|	)
	|ИЗ
	|	Документ.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокАксессуаровШапка = Макет.ПолучитьОбласть("СписокАксессуаровШапка");
	ОбластьСписокАксессуаров = Макет.ПолучитьОбласть("СписокАксессуаров");
	ОбластьПорядокРаботШапка = Макет.ПолучитьОбласть("ПорядокРаботШапка");
	ОбластьПорядокРабот = Макет.ПолучитьОбласть("ПорядокРабот");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		//Из выборки подтянуть значения по совпадающим реквизитам
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		//Из макета ТабДока взять Дату старого формата и переделать на новый вид представления
		ОбластьЗаголовок.Параметры.Дата = Формат(ОбластьЗаголовок.Параметры.Дата,"ДЛФ=DD");
		//Добавить макет в Табличный документ

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСписокАксессуаровШапка);
		ВыборкаСписокАксессуаров = Выборка.СписокАксессуаров.Выбрать();
		Пока ВыборкаСписокАксессуаров.Следующий() Цикл
			ОбластьСписокАксессуаров.Параметры.Заполнить(ВыборкаСписокАксессуаров);
			ТабДок.Вывести(ОбластьСписокАксессуаров, ВыборкаСписокАксессуаров.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьПорядокРаботШапка);
		ВыборкаПорядокРабот = Выборка.ПорядокРабот.Выбрать();
		Пока ВыборкаПорядокРабот.Следующий() Цикл
			ОбластьПорядокРабот.Параметры.Заполнить(ВыборкаПорядокРабот);
			ТабДок.Вывести(ОбластьПорядокРабот, ВыборкаПорядокРабот.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
