
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Заказы") Тогда
		// Заполнение шапки
		Доставка = ДанныеЗаполнения.Доставка;
		Контрагент = ДанныеЗаполнения.Контрагент;
		МодельЯхты = ДанныеЗаполнения.МодельЯхты;
		НаименованиеСудна = ДанныеЗаполнения.НаименованиеСудна;
		Покраска = ДанныеЗаполнения.Покраска;
		ПроцентПредоплаты = ДанныеЗаполнения.ПроцентПредоплаты;
		Сотрудник = ДанныеЗаполнения.Сотрудник;
		Заказ = ДанныеЗаполнения.Ссылка;
		СуммаЗаказа = ДанныеЗаполнения.СуммаЗаказа;
		СуммаПредоплаты = ДанныеЗаполнения.СуммаПредоплаты;
		ЦенаСудна = ДанныеЗаполнения.ЦенаСудна;
		Для Каждого ТекСтрокаДанныеДоставки Из ДанныеЗаполнения.ДанныеДоставки Цикл
			НоваяСтрока = ДанныеДоставки.Добавить();
			НоваяСтрока.АдресДоставки = ТекСтрокаДанныеДоставки.АдресДоставки;
			НоваяСтрока.ВремяДоставки = ТекСтрокаДанныеДоставки.ВремяДоставки;
			НоваяСтрока.ДатаДоставки = ТекСтрокаДанныеДоставки.ДатаДоставки;
			НоваяСтрока.КонтактыПолучателя = ТекСтрокаДанныеДоставки.КонтактыПолучателя;
			НоваяСтрока.Получатель = ТекСтрокаДанныеДоставки.Получатель;
		КонецЦикла;
		Для Каждого ТекСтрокаДополнительныеРаботы Из ДанныеЗаполнения.ДополнительныеРаботы Цикл
			НоваяСтрока = ДополнительныеРаботы.Добавить();
			НоваяСтрока.ДополнительныйЦвет = ТекСтрокаДополнительныеРаботы.ДополнительныйЦвет;
			НоваяСтрока.ЦенаСНДС = ТекСтрокаДополнительныеРаботы.ЦенаСНДС;
		КонецЦикла;
		Для Каждого ТекСтрокаСпецификацияСудна Из ДанныеЗаполнения.СпецификацияСудна Цикл
			НоваяСтрока = СпецификацияСудна.Добавить();
			НоваяСтрока.КоличествоМест = ТекСтрокаСпецификацияСудна.КоличествоМест;
			НоваяСтрока.Материал = ТекСтрокаСпецификацияСудна.Материал;
			НоваяСтрока.НаличиеМачты = ТекСтрокаСпецификацияСудна.НаличиеМачты;
			НоваяСтрока.СтандартныйЦвет = ТекСтрокаСпецификацияСудна.СтандартныйЦвет;
			НоваяСтрока.ТипЯхты = ТекСтрокаСпецификацияСудна.ТипЯхты;
		КонецЦикла;
		Для Каждого ТекСтрокаСписокАксессуаров Из ДанныеЗаполнения.СписокАксессуаров Цикл
			НоваяСтрока = СписокАксессуаров.Добавить();
			НоваяСтрока.Аксессуар = ТекСтрокаСписокАксессуаров.Аксессуар;
			НоваяСтрока.Количество = ТекСтрокаСписокАксессуаров.Количество;
			НоваяСтрока.СуммаСНДС = ТекСтрокаСписокАксессуаров.СуммаСНДС;
			НоваяСтрока.ЦенаСНДС = ТекСтрокаСписокАксессуаров.ЦенаСНДС;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Продажи 
	Движения.Продажи.Записывать = Истина;
	Движение = Движения.Продажи.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Сумма = СуммаЗаказа;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
